// 18.題目：判斷101-200之間有多少個質數，並輸出所有質數。 （必須用迴圈完成）
// 程序分析：判斷質數的方法：用一個數分別去除2到sqrt(這個數)，如果能被整除，則表明此數不是質數，反之是質數。
// 1.101到200的質數有：101,103,107,109,113,127,131,137,139,149,
// 151,157,163,167,173,179,181,191,193,197,199

function Prime() {
  var num = '';
  for (var sqrt = 101; sqrt <= 200; sqrt++) {
    for (var j = 2; j < sqrt/2; j++) {

      if (sqrt % j === 0) {
        break;
      }
    }
    if (sqrt/2 <= j ) {
      num += sqrt + ' ';

    }
  }


  num += "\n";
  return num;

}
console.log(Prime());
